'''2) შექმენით სია რომელშიც ჩამოწერთ მინიმუმ 10 პროგრამირების ენას, შემდეგ ამ სიაში 
მყოფი თქვენთვის ყველაზე არასასურველი ენა ჩაანაცვლეთ ახლით. საბოლოოდ კი slicing-ის გამოყენებით გამოიტანეთ სიის ნაწილები:

დადებითი slicing:
პირველიდან 5-ის ჩათვლით
2-დან ბოლომდე
4-დან 8-მდე

უარყოფითი:

მეექსვედან ბოლომდე
მეექვსემდე ყველაფერი
მეექვსეს ჩათვლით თავიდან ყველაფერი

ბონუს:
მთელი სია გამოიტანეთ თავიდან ბოლომდე შემობრუნებულად'''


languages = ["Python", "Java", "C++", "JavaScript", "Ruby", "PHP", "Swift", "Go", "Perl", "R"]
languages[5] = "Rust"

print(languages[0:5])
print(languages[1:])
print(languages[3:8])

print(languages[-5:])
print(languages[:-5])
print(languages[-10:-4])

print(languages[::-1])
