'''2) შექმენით პროგრამა რომელშიც გექნებათ პროდუქტების სიის ცვლადი, სადაც პირველ 3 ელემენტს ჩვეულებრივად ჩამოწერეთ,
 ხოლო ბოლო 2 უნდა იყოს ცვლადებით დამატებული. მომხმარებელს შეეკითხეთ რომელი პროდუქტი სურს (უნდა შემოიტანოს ინდექსი 
 რომელსაც ინტეჯერად გარადაქმნით) შემდეგ გამოუტანეთ ეს პროდუქტი
 და პროდუქტების სიაში მომხმარებლისათვის სასურველი პროდუქტი ჩაანაცვლეთ ახლით. საბოლოდ დაბეჭდეთ მიღებული სია'''

# პროდუქტების საწყისი სია
products = ["ვაშლი", "ბანანი", "ფორთოხალი"]

# ცვლადებით დამატებული ორი პროდუქტი
product1 = "ყურძენი"
product2 = "ანანასი"
products.append(product1)
products.append(product2)

# მომხმარებლისათვის პროდუქტის არჩევა
index = int(input("გთხოვთ შეიყვანოთ სასურველი პროდუქტის ინდექსი : "))
if 0 <= index < len(products):
    print(f"თქვენ აირჩიეთ: {products[index]}")
    
    # მომხმარებლის მიერ ახალი პროდუქტის შეყვანა
    new_product = input("შეიყვანეთ ახალი პროდუქტის სახელი, რომლითაც ჩაანაცვლებთ არჩეულს: ")
    products[index] = new_product
    
    # საბოლოო სიის დაბეჭდვა
    print("განახლებული პროდუქტების სია:", products)
else:
    print("შეყვანილი ინდექსი არასწორია!")
