sport = input("შეიყვანე შენი საყვარელი სპორტი: ")
print("შენი საყვარელი სპორტია:", sport)

name = input("შეიყვანე შენი სახელი: ")
surname = input("შეიყვანე შენი გვარი: ")
age = input("შეიყვანე შენი ასაკი: ")
city = input("შეიყვანე საცხოვრებელი ქალაქი: ")
hobby = input("შეიყვანე შენი ჰობი: ")

print(f"შენი სახელია {name} {surname}, შენი ასაკია {age} წელი, ცხოვრობ {city}-ში და შენი ჰობია {hobby}.")

num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))
num3 = int(input("შეიყვანე მესამე რიცხვი: "))

average = (num1 + num2 + num3) / 3
print("რიცხვების საშუალო არითმეტიკული არის:", average)
